iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/УБХТарифыРазмещения/УБХТарифыРазмещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УБХТарифыРазмещения</name>
  <attributes>
    <name>ВидТарифа</name>
    <type>
      <types>EnumRef.УБХВидыТарифовРазмещения</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентскаяГруппа</name>
    <type>
      <types>CatalogRef.УБХКлиентскиеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.УБХПроектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСпециальногоТарифа</name>
    <type>
      <types>EnumRef.УБХСтатусыСпециальныхТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогРасширенногоОбъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогУчетаРасширенногоОбъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаРасширенногоОбъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьШтырьевоАнтены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатаЗаМодуль</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатаЗаСтойку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьКонтейнера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьТермошкафа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонструкцииАМС</name>
    <type>
      <types>EnumRef.УБХТипыКонструкцийАМС</types>
    </type>
  </attributes>
</mdclass:Catalog>

iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/УБХСтандартныеТарифыКлиентскихГрупп/УБХСтандартныеТарифыКлиентскихГрупп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБХСтандартныеТарифыКлиентскихГрупп</name>
  <resources>
    <name>ТарифРазмещения</name>
    <type>
      <types>CatalogRef.УБХТарифыРазмещения</types>
    </type>
  </resources>
  <dimensions>
    <name>КлиентскаяГруппа</name>
    <type>
      <types>CatalogRef.УБХКлиентскиеГруппы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iTower_20__GIS_Управление_пространственными_данными/src/Enums/УБХВидыТарифовРазмещения/УБХВидыТарифовРазмещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБХВидыТарифовРазмещения</name>
  <enumValues>
    <name>Специальный</name>
  </enumValues>
  <enumValues>
    <name>Стандартный</name>
  </enumValues>
</mdclass:Enum>

iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/УБХТарифыРазмещения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидТарифа = Перечисления.УБХВидыТарифовРазмещения.Стандартный
		ИЛИ (ДополнительныеСвойства.Свойство("КэшВидаТариф") 
		И НЕ ДополнительныеСвойства.КэшВидаТариф = ВидТарифа) Тогда
		ЗаписатьДанныеПоКлиентскойГруппе();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДанныеПоКлиентскойГруппе()

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УБХСтандартныеТарифыКлиентскихГрупп");
	ЭлементБлокировки.УстановитьЗначение("КлиентскаяГруппа", КлиентскаяГруппа);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
 
	НаборЗаписей = РегистрыСведений.УБХСтандартныеТарифыКлиентскихГрупп.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КлиентскаяГруппа.Установить(КлиентскаяГруппа);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Если ВидТарифа = Перечисления.УБХВидыТарифовРазмещения.Стандартный
		И ЗначениеЗаполнено(КлиентскаяГруппа) Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.КлиентскаяГруппа = КлиентскаяГруппа;
		НоваяЗапись.ТарифРазмещения  = Ссылка;
	КонецЕсли;
	
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидТарифа = Перечисления.УБХВидыТарифовРазмещения.Стандартный Тогда
		НепроверяемыеРеквизиты = Новый Массив;
		НепроверяемыеРеквизиты.Добавить("Проект");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
